#Series.str.contains()

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(['Mouse','dog','house and parrot','23'],columns=['values'])
df

             values
0             Mouse
1               dog
2  house and parrot
3                23

In [3]:
df['v1'] = df['values'].str.contains('dog')
df

             values     v1
0             Mouse  False
1               dog   True
2  house and parrot  False
3                23  False

In [4]:
df['v2'] = df['values'].str.contains('og',regex=False)
df

             values     v1     v2
0             Mouse  False  False
1               dog   True   True
2  house and parrot  False  False
3                23  False  False

In [5]:
df['v3'] = df['values'].str.contains('oG',regex=False,case=True) # case=True: 대소문자 구별
df

             values     v1     v2     v3
0             Mouse  False  False  False
1               dog   True   True  False
2  house and parrot  False  False  False
3                23  False  False  False

In [6]:
df['v4'] = df['values'].str.contains('\d',regex=True)
df['v5'] = df['values'].str.contains('\d',regex=False) # \d는 일반 string으로 인식, \d가 포함된게 없으므로 모두 False로 나옴
df

             values     v1     v2     v3     v4     v5
0             Mouse  False  False  False  False  False
1               dog   True   True  False  False  False
2  house and parrot  False  False  False  False  False
3                23  False  False  False   True  False

In [7]:
df2 = pd.DataFrame(['40','40.0','41','41.0','35'],columns=['values'])
df2

  values
0     40
1   40.0
2     41
3   41.0
4     35

In [9]:
df2['v1'] = df2['values'].str.contains('.0',regex=True)  # 0앞에 어떤 문자라도 있으면 됨
df2['v1-2'] = df2['values'].str.contains('\.0',regex=True) # 0앞에 .이 있어야 함, 아래와 같은 결과가 나옴
df2['v2'] = df2['values'].str.contains('.0',regex=False)
df2

  values     v1     v2   v1-2
0     40   True  False  False
1   40.0   True   True   True
2     41  False  False  False
3   41.0   True   True   True
4     35  False  False  False

# Series.str.extract()

In [10]:
df3 = pd.DataFrame(['a1','b2','c3'],columns=['values'])
df3

  values
0     a1
1     b2
2     c3

In [11]:
# 모든 요소가 필수
# a또는 b가 있을 것이고 뒤에는 숫자가 올 것이다 라는 의미
df3['values'].str.extract(r'([ab])(\d)')

     0    1
0    a    1
1    b    2
2  NaN  NaN

In [13]:
# ? 앞의 요소는 있어도되고 없어도 되며 숫자가 올 것임

df3['values'].str.extract(r'([ab])?(\d)')

     0  1
0    a  1
1    b  2
2  NaN  3

In [15]:
df3['values'].str.extract(r'[ab](\d)',expand=False) # dataframe이 아닌 series형태로 출력

0      1
1      2
2    NaN
Name: values, dtype: object